# 1.	Loading the dataset onto a DataFrame

In [2]:
import pandas as pd

df=pd.read_csv('IPL IMB381IPL2013.csv')

df.head()

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

# 2.	Displaying first few records of the DataFrame

In [4]:
df.head()

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

# 3.	Finding metadata of the DataFrame

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 26 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sl.NO.         130 non-null    int64
 1   PLAYER NAME    130 non-null    object
 2   AGE            130 non-null    int64
 3   COUNTRY        130 non-null    object
 4   TEAM           130 non-null    object
 5   PLAYING ROLE   130 non-null    object
 6   T-RUNS         130 non-null    int64
 7   T-WKTS         130 non-null    int64
 8   ODI-RUNS-S     130 non-null    int64
 9   ODI-SR-B       130 non-null    float64
 10  ODI-WKTS       130 non-null    int64
 11  ODI-SR-BL      130 non-null    float64
 12  CAPTAINCY EXP  130 non-null    int64
 13  RUNS-S         130 non-null    int64
 14  HS             130 non-null    int64
 15  AVE            130 non-null    float64
 16  SR-B           130 non-null    float64
 17  SIXERS         130 non-null    int64
 18  RUNS-C         130 non-null    int64
 19  WKTS           130 non-null    int64
 20  AVE-BL         130 non-null    float64
 21  ECON           130 non-null    float64
 22  SR-BL          130 non-null    float64
 23  AUCTION YEAR   130 non-null    int64
 24  BASE PRICE     130 non-null    int64
 25  SOLD PRICE     130 non-null    int64
dtypes: float64(7), int64(15), object(4)
memory usage: 26.5+ KB

# 4.	Finding Summary of the DataFrame

In [8]:
df.describe(include='all')

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
count,130.000000,130,130.000000,130,130,130,130.000000,130.000000,130.000000,130.000000,...,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,130.000000,1.300000e+02,1.300000e+02
unique,NaN,130,NaN,10,17,4,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,"Abdulla, YA",NaN,IND,CSK,Bowler,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,1,NaN,53,14,44,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,65.500000,NaN,2.092308,NaN,NaN,NaN,2166.715385,66.530769,2508.738462,71.164385,...,111.053462,17.692308,475.523077,17.169231,23.110231,6.204462,17.382615,2009.092308,1.922308e+05,5.212231e+05
std,37.671829,NaN,0.576627,NaN,NaN,NaN,3305.646757,142.676855,3582.205625,25.898440,...,35.928907,23.828146,558.314049,21.816763,20.802057,4.941531,15.273422,1.377821,1.530973e+05,4.068074e+05
min,1.000000,NaN,1.000000,NaN,NaN,NaN,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2008.000000,2.000000e+04,2.000000e+04
25%,33.250000,NaN,2.000000,NaN,NaN,NaN,25.500000,0.000000,73.250000,65.650000,...,98.237500,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2008.000000,1.000000e+05,2.250000e+05
50%,65.500000,NaN,2.000000,NaN,NaN,NaN,542.500000,7.000000,835.000000,78.225000,...,118.510000,6.000000,297.000000,8.500000,24.785000,7.380000,19.935000,2008.000000,2.000000e+05,4.375000e+05
75%,97.750000,NaN,2.000000,NaN,NaN,NaN,3002.250000,47.500000,3523.500000,86.790000,...,129.102500,29.750000,689.250000,23.750000,35.580000,8.247500,26.212500,2011.000000,2.250000e+05,7.000000e+05
max,130.000000,NaN,3.000000,NaN,NaN,NaN,15470.000000,800.000000,18426.000000,116.660000,...,235.490000,129.000000,1975.000000,83.000000,126.300000,38.110000,100.200000,2011.000000,1.350000e+06,1.800000e+06

# 5.	Slicing and Indexing a dataframe

In [10]:
df.loc[:9, ['PLAYER NAME', 'COUNTRY', 'SOLD PRICE']]

     PLAYER NAME COUNTRY  SOLD PRICE
0    Abdulla, YA      SA       50000
1   Abdur Razzak     BAN       50000
2    Agarkar, AB     IND      350000
3      Ashwin, R     IND      850000
4   Badrinath, S     IND      800000
5     Bailey, GJ     AUS       50000
6      Balaji, L     IND      500000
7  Bollinger, DE     AUS      700000
8       Botha, J      SA      950000
9    Boucher, MV      SA      450000

# 6.	Selecting Columns by Column Names (eg: PLAYER NAME)

In [12]:
df['PLAYER NAME']

0       Abdulla, YA
1      Abdur Razzak
2       Agarkar, AB
3         Ashwin, R
4      Badrinath, S
           ...
125       Yadav, AS
126     Younis Khan
127    Yuvraj Singh
128     Zaheer Khan
129      Zoysa, DNT
Name: PLAYER NAME, Length: 130, dtype: object

# 7.	Finding Unique Occurances of Values in Columns (eg: COUNTRY)

In [14]:
df['COUNTRY'].unique()

array(['SA', 'BAN', 'IND', 'AUS', 'WI', 'SL', 'NZ', 'ENG', 'PAK', 'ZIM'],
      dtype=object)

# 8.	Cross-tabulation between two columns (eg: AGE & PLAYING ROLE)

In [16]:
pd.crosstab(df['AGE'], df['PLAYING ROLE'])

PLAYING ROLE  Allrounder  Batsman  Bowler  W. Keeper
AGE
1                      4        5       7          0
2                     25       21      29         11
3                      6       13       8          1

# 9.	Sorting dataframe by column values (eg: SOLD PRICE)

In [33]:
df_sorted=df.sort_values(by='SOLD PRICE')
df_sorted.head()

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE,Premium
73,74,"Noffke, AA",2,AUS,RCB,Allrounder,0,0,0,0.00,...,0,40,1,40.00,10.00,24.00,2010,20000,20000,0
46,47,Kamran Khan,1,IND,RR+,Bowler,0,0,0,0.00,...,0,224,9,24.89,8.48,17.78,2009,20000,24000,4000
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0,307,15,20.47,8.90,13.93,2009,50000,50000,0
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0,29,0,0.00,14.50,0.00,2008,50000,50000,0
118,119,Van der Merwe,2,SA,RCB+,Allrounder,0,0,39,95.12,...,8,427,18,23.72,6.83,20.94,2011,50000,50000,0

# 10.	Which player got the maximum premium on the base price?

In [25]:
df['Premium']=df['SOLD PRICE'] - df['BASE PRICE']
max_premium_player=df.loc[df['Premium'].idxmax()]
max_premium_player[['PLAYER NAME','Premium']]

PLAYER NAME    Kohli, V
Premium         1650000
Name: 50, dtype: object

# 11.	Which players got the maximum premium offering on their base price?

In [27]:
max_premium=df['Premium'].max()
premium_players=df[df['Premium']==max_premium]
premium_players[['PLAYER NAME','Premium']]

   PLAYER NAME  Premium
50    Kohli, V  1650000

# 12.	What is the average SOLD PRICE for each age category?

In [29]:
df.groupby('AGE')['SOLD PRICE'].mean()

AGE
1    720250.000000
2    484534.883721
3    520178.571429
Name: SOLD PRICE, dtype: float64

# 13.	Average SOLD PRICE for Different Playing Roles in Each Age Category?

In [31]:
df.groupby(['AGE', 'PLAYING ROLE'])['SOLD PRICE'].mean().unstack()

PLAYING ROLE     Allrounder       Batsman         Bowler      W. Keeper
AGE
1             587500.000000  1.110000e+06  517714.285714            NaN
2             449400.000000  6.547619e+05  397931.034483  467727.272727
3             766666.666667  4.576923e+05  414375.000000  700000.000000